ErpTest/src/DataProcessors/пкУправлениеПродажами/пкУправлениеПродажами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>пкУправлениеПродажами</name>
  <comment>Рарус</comment>
  <attributes>
    <name>РежимОтображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

ErpTest/src/Enums/пкСтатусыЗаданийНаПеревозку/пкСтатусыЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыЗаданийНаПеревозку</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>КДоставке</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкВидыОперацийЗаданийНаПеревозку/пкВидыОперацийЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкВидыОперацийЗаданийНаПеревозку</name>
  <enumValues>
    <name>ДоставкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>Перекат</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуРегионами</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкЗаданиеНаПеревозку/пкЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкЗаданиеНаПеревозку</name>
  <basedOn>Catalog.ОбъектыЭксплуатации</basedOn>
  <basedOn>Document.пкЗаданиеНаПеревозку</basedOn>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСрокиАренды</registerRecords>
  <registerRecords>InformationRegister.пкРезервТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкМоделиКДоставкеПоЗаявкамНаАрендуТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкТехникаКПеремещениюМеждуРегионами</registerRecords>
  <registerRecords>InformationRegister.пкДатыАренды</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.пкВидыОперацийЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионПолучатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаТехники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗаказНарядНаОсмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеПодтверждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПодтвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КПроверке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденоКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийВодителю</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Повреждения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/DataProcessors/пкУправлениеПродажами/Forms/ИзменениеДатыДоставки/Module.bsl
&НаСервере
Процедура ИзменитьДатыНаСервере()
    
    Для Каждого Строка ИЗ ТехникаКДоставке Цикл
        Если Строка.ДатаДоставки <> Строка.ДатаДоставкиДоИзменения ИЛИ Строка.ДатаАренды <> Строка.ДатаАрендыДоИзменения Тогда
            Если ЗначениеЗаполнено(Строка.ЗаданиеНаПеревозку) Тогда
                ЗаданиеНаПеревозку = Строка.ЗаданиеНаПеревозку.ПолучитьОбъект();
                ЗаданиеНаПеревозку.ДатаОтгрузки = Строка.ДатаДоставки;
                ЗаданиеНаПеревозку.ДатаАренды   = Строка.ДатаАренды;
                
                Попытка
                    ЗаданиеНаПеревозку.Записать(РежимЗаписиДокумента.Проведение);
                Исключение
                КонецПопытки;
            Иначе
                ОформитьЗаданиеНаПеревозку(Строка.ДатаДоставки, Строка.ДатаАренды);   
            КонецЕсли;    
        КонецЕсли;    
    КонецЦикла; 
        
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДаты(Команда)
    
    ИзменитьДатыНаСервере();
    
    ОповеститьОВыборе(Неопределено);
    
КонецПроцедуры

&НаСервере
Процедура ОформитьЗаданиеНаПеревозку(ДатаДоставки, ДатаАренды)
            
    ЗаданиеНаПеревозку = Документы.пкЗаданиеНаПеревозку.СоздатьДокумент();
    
    ЗаданиеНаПеревозку.Дата                  = ТекущаяДата();
    ЗаданиеНаПеревозку.Статус                = Перечисления.пкСтатусыЗаданийНаПеревозку.Запланировано;
    
    ЗаданиеНаПеревозку.ВидОперации           = ?(ВидДоставки = "Отгрузка", Перечисления.пкВидыОперацийЗаданийНаПеревозку.ДоставкаКлиенту, 
        Перечисления.пкВидыОперацийЗаданийНаПеревозку.ВозвратОтКлиента);
    
    ЗаданиеНаПеревозку.ДатаОтгрузки          = ДатаДоставки;
    ЗаданиеНаПеревозку.ДатаАренды            = ДатаАренды;
    ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники = ЗаявкаНаАрендуТехники;
    ЗаданиеНаПеревозку.Модель                = Модель;
    ЗаданиеНаПеревозку.АдресДоставки         = ЗаявкаНаАрендуТехники.АдресДоставки;
    ЗаданиеНаПеревозку.ВремяДоставкиС        = ЗаявкаНаАрендуТехники.ВремяДоставкиС;
    ЗаданиеНаПеревозку.ВремяДоставкиПо       = ЗаявкаНаАрендуТехники.ВремяДоставкиПо;
    ЗаданиеНаПеревозку.СпособДоставки        = ЗаявкаНаАрендуТехники.СпособДоставки;
    ЗаданиеНаПеревозку.Подразделение         = ЗаявкаНаАрендуТехники.ПодразделениеОтгрузки;
    
    Если ВидДоставки = "Возврат" Тогда
        ЗаданиеНаПеревозку.СкладПолучатель   = ЗаявкаНаАрендуТехники.ПодразделениеОтгрузки.пкСкладТехники;      
    КонецЕсли;
    
    Попытка
        ЗаданиеНаПеревозку.Записать(РежимЗаписиДокумента.Проведение);        
    Исключение
    КонецПопытки;
        
КонецПроцедуры    

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("ЗаявкаНаАрендуТехники") Тогда
        ЗаявкаНаАрендуТехники = Параметры.ЗаявкаНаАрендуТехники;
    КонецЕсли;
    
    Если Параметры.Свойство("Модель") Тогда
        Модель = Параметры.Модель;
    КонецЕсли;
    
    Если Параметры.Свойство("Дата") Тогда
        Дата = Параметры.Дата;
    Иначе
        Дата = Неопределено;
    КонецЕсли;
    
    Если Параметры.Свойство("ДатаАренды") Тогда
        ДатаАренды = Параметры.ДатаАренды;
    Иначе
        ДатаАренды = Неопределено;
    КонецЕсли;
    
    Если Параметры.Свойство("ВидДоставки") Тогда
        ВидДоставки = Параметры.ВидДоставки;
        
        Если ВидДоставки = "Отгрузка" Тогда
            Элементы.ТехникаКДоставкеДатаДоставки.Заголовок = "Дата отгрузки";  
            Элементы.ТехникаКДоставкеДатаАренды.Заголовок   = "Начало аренды"; 
            
            Элементы.ОбщаяДатаДоставки.Заголовок = "Дата отгрузки";  
            Элементы.ОбщаяДатаАренды.Заголовок   = "Начало аренды";
        Иначе
            Элементы.ТехникаКДоставкеДатаДоставки.Заголовок = "Дата возврата";    
            Элементы.ТехникаКДоставкеДатаАренды.Заголовок   = "Последний день";
            
            Элементы.ОбщаяДатаДоставки.Заголовок = "Дата возврата";  
            Элементы.ОбщаяДатаАренды.Заголовок   = "Последний день";
        КонецЕсли;    
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(ЗаявкаНаАрендуТехники) ИЛИ НЕ ЗначениеЗаполнено(Модель) ИЛИ НЕ ЗначениеЗаполнено(ВидДоставки) Тогда
        Отказ = Истина;    
    КонецЕсли;  
    
    Если НЕ Отказ Тогда
        ТехникаКДоставке.Загрузить(пкУправлениеТехникойСервер.ПолучитьТехникуКДоставке(ЗаявкаНаАрендуТехники, Модель, ВидДоставки, Дата, ДатаАренды));
    КонецЕсли;    
    
КонецПроцедуры

&НаКлиенте
Процедура ТехникаКДоставкеДатаАрендыПриИзменении(Элемент)
    
    ТекущиеДанные = Элементы.ТехникаКДоставке.ТекущиеДанные;
    
    Если ВидДоставки = "Отгрузка" Тогда
        ТекущиеДанные.ДатаДоставки = ТекущиеДанные.ДатаАренды;
    Иначе
        ТекущиеДанные.ДатаДоставки = ТекущиеДанные.ДатаАренды + 3600 * 24;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляВсех(Команда)
    
    Для Каждого Строка ИЗ ТехникаКДоставке Цикл
        Строка.ДатаДоставки = ОбщаяДатаДоставки;
        Строка.ДатаАренды   = ОбщаяДатаАренды;
    КонецЦикла;    
        
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяДатаАрендыПриИзменении(Элемент)
    
    Если ВидДоставки = "Отгрузка" Тогда
        ОбщаяДатаДоставки = ОбщаяДатаАренды;
    Иначе
        ОбщаяДатаДоставки = ОбщаяДатаАренды + 3600 * 24;
    КонецЕсли;
    
КонецПроцедуры
